weight_data = {
    'keyWords': [['高铁', '高速铁路'], ['方式', '方法', '形式', '手段'], ['出行'], ['性价比', '受欢迎', '热门', '畅销', '出名'], ['速度', '速率'],
                 ['舒适', '不适感'], ['正点', '准点', '误点'], ['成本', '效率', '费用', '效益', '价格']],
    'keyWeight': [0.125, 0.125, 0.125, 0.125, 0.125, 0.125, 0.125, 0.125],
    'keyHitTimes': [10, 10, 10, 10, 10, 10, 10, 10],
    'detailWords': [['40', '四十', '6', '六', '贵阳', '昆明', '桂林', '成都', '柳州', '南宁', '贵州', '遵义', '蒙自'],
                    ['天气', '天候', '飞机', '直升机', '民航机', '起飞', '飞行中', '航空器'],
                    ['电源', '电池', '电路', '开关', '控制器', '元件', '设备', '餐车', '无线', 'wifi'], ['运营', '营运', '运行'], ['专业'],
                    ['管理', '监管', '行政']],
    'detailWeight': [0.167, 0.167, 0.167, 0.167, 0.167, 0.167],
    'detailHitTimes': [10, 10, 10, 10, 10, 10],
    'allHitTimes': 50,
}

score_data = {
    'key': [18.762, 24.803, 28.705, 31.686, 34.144, 36.263, 38.145, 39.851, 41.422, 42.886, 44.263, 45.570, 46.817,
            48.015, 49.172, 50.294, 51.385, 52.452, 53.498, 54.526, 55.540, 56.542, 57.536, 58.524, 59.508, 60.492,
            61.476, 62.464, 63.458, 64.460, 65.474, 66.502, 67.548, 68.615, 69.706, 70.828, 71.985, 73.183, 74.430,
            75.737, 77.114, 78.578, 80.149, 81.855, 83.737, 85.856, 88.314, 91.295, 95.197, 100],
    'detail': [21.009, 25.842, 28.964, 31.349, 33.315, 35.011, 36.516, 37.881, 39.138, 40.309, 41.410, 42.456,
               43.454, 44.412, 45.338, 46.235, 47.108, 47.962, 48.798, 49.621, 50.432, 51.234, 52.029, 52.819,
               53.607, 54.393, 55.181, 55.971, 56.766, 57.568, 58.379, 59.202, 60.038, 60.892, 61.765, 62.662,
               63.588, 64.546, 65.544, 66.590, 67.691, 68.862, 70.119, 71.484, 72.989, 74.685, 76.651, 79.036,
               82.158, 86.991],
    'total': [19.436, 25.115, 28.783, 31.585, 33.895, 35.888, 37.657, 39.260, 40.737, 42.113, 43.407, 44.635,
              45.808, 46.934, 48.022, 49.076, 50.102, 51.105, 52.088, 53.054, 54.007, 54.950, 55.884, 56.813,
              57.738, 58.662, 59.587, 60.516, 61.450, 62.393, 63.346, 64.312, 65.295, 66.298, 67.324, 68.378,
              69.466, 70.592, 71.765, 72.993, 74.287, 75.663, 77.140, 78.743, 80.512, 82.505, 84.815, 87.617,
              91.285, 96.964],
    'keyStatistic': {"mean": 59.97524000000001, "sigma": 18.79245, "difficulty": 0.5997524000000001,
                     "discrimination": 0.22717785714285707},
    'detailStatistic': {"mean": 54, "sigma": 15.07761, "difficulty": 0.54, "discrimination": 0.18209571428571436},
    'totalStatistic': {"mean": 58.2, "sigma": 17.71612, "difficulty": 0.582, "discrimination": 0.21396214285714282},

}

cost_data = {
    "date": "2019-03-09", "finish": True,
    "costData": [{"itrTimes": 200, "cost": 13.6349}, {"itrTimes": 400, "cost": 12.9269},
                 {"itrTimes": 600, "cost": 12.2557}, {"itrTimes": 800, "cost": 11.6194},
                 {"itrTimes": 1000, "cost": 11.0161}, {"itrTimes": 1200, "cost": 10.4441},
                 {"itrTimes": 1400, "cost": 9.9018}, {"itrTimes": 1600, "cost": 9.3877},
                 {"itrTimes": 1800, "cost": 8.9003}, {"itrTimes": 2000, "cost": 8.4381},
                 {"itrTimes": 2200, "cost": 8}, {"itrTimes": 2400, "cost": 7.5846},
                 {"itrTimes": 2600, "cost": 7.1908}, {"itrTimes": 2800, "cost": 6.8174},
                 {"itrTimes": 3000, "cost": 6.4635}, {"itrTimes": 3200, "cost": 6.1279},
                 {"itrTimes": 3400, "cost": 5.8097}, {"itrTimes": 3600, "cost": 5.508},
                 {"itrTimes": 3800, "cost": 5.222}, {"itrTimes": 4000, "cost": 4.9509},
                 {"itrTimes": 4200, "cost": 4.6938}, {"itrTimes": 4400, "cost": 4.4501},
                 {"itrTimes": 4600, "cost": 4.2191}, {"itrTimes": 4800, "cost": 4},
                 {"itrTimes": 5000, "cost": 3.7923}, {"itrTimes": 5200, "cost": 3.5954},
                 {"itrTimes": 5400, "cost": 3.4087}, {"itrTimes": 5600, "cost": 3.2317},
                 {"itrTimes": 5800, "cost": 3.0639}, {"itrTimes": 6000, "cost": 2.9048},
                 {"itrTimes": 6200, "cost": 2.754}, {"itrTimes": 6400, "cost": 2.611},
                 {"itrTimes": 6600, "cost": 2.4755}, {"itrTimes": 6800, "cost": 2.3469},
                 {"itrTimes": 7000, "cost": 2.2251}, {"itrTimes": 7200, "cost": 2.1095},
                 {"itrTimes": 7400, "cost": 2}, {"itrTimes": 7600, "cost": 1.8962},
                 {"itrTimes": 7800, "cost": 1.7977}, {"itrTimes": 8000, "cost": 1.7044},
                 {"itrTimes": 8200, "cost": 1.6159}, {"itrTimes": 8400, "cost": 1.532},
                 {"itrTimes": 8600, "cost": 1.4524}, {"itrTimes": 8800, "cost": 1.377},
                 {"itrTimes": 9000, "cost": 1.3055}, {"itrTimes": 9200, "cost": 1.2377},
                 {"itrTimes": 9400, "cost": 1.1735}, {"itrTimes": 9600, "cost": 1.1125},
                 {"itrTimes": 9800, "cost": 1.0548}, {"itrTimes": 10000, "cost": 1}],
}

questions = {
    "count": 358,
    'questions': [
        {
            "questionId": 2,
            "rawText": "高铁是现在是最受欢迎的出行方式。首先，高铁速度快，比如说，以前从贵阳到北京，要用40个小时左右，但现在高铁只需要6个小时，大大减少了路途时间。其次，高铁正点率高，因为高铁受天气条件影响较小，通常都可以准时发车，按时到达。最后，高铁环境舒适，高铁坐席宽敞，运行时速度平稳，没有噪音，餐车环境整洁，配有电源插座和无线网络，乘坐高铁很少会造成不适感，对于不习惯坐飞机出行的人士，高铁是更理想的选择。但高铁的建设，前期投资非常巨大，对设备技术、制作工艺要求都很高，后期的管理运营也需要更专业的人员来完成。",
            "keywords": "「「高铁，高速铁路」，「方式，方法，形式，手段」，「出行」，「性价比，受欢迎，热门，畅销，出名」」",
            "mainwords": "「「速度，速率」，「舒适，不适感」，「正点，准点，误点」，「成本，效率，费用，效益，价格」」",
            "detailwords": "「「「40，四十，6，六，贵阳，昆明，桂林，成都，柳州，南宁，贵州，遵义，蒙自」，「天气，天候，飞机，直升机，民航机，起飞，飞行中，航空器」，「电源，电池，电路，开关，控制器，元件，设备，餐车，无线，wifi」」，「「运营，营运，运行」，「专业」，「管理，监管，行政」」」",
            "inOptimize": False,
            "lastOpDate": '2019-03-09',
            "upCount": 66,
            "downCount": 12,
        },
        {
            "questionId":
                3,
            "rawText":
                "城市会让生活更美好。在城市里居住，可以享受更多、更高质量的医疗和教育资源，生活的便利程度也更高。城市也是集聚人才，激发创意的地方，文艺复兴时候的佛罗伦萨，硅谷所在的旧金山都是典型的例子。另外，城市化也有利于国家经济模式的转型，从农业为主，往工业和第三产业的转型，2011年，中国的城市化率已经超过了50%。但城市也会带来拥挤、污染以及生育率下降等负面问题，需要更好的规划发展来解决。",
            "keywords":
                "「「美好，幸福，快乐」，「城市，郊区，大都市」，「生活」」",
            "mainwords":
                "「「资源」，「人才，人材」，「经济模式，市场经济」，「问题，难题」」",
            "detailwords":
                "「「「教育，教学」，「医疗，照护，卫生保健，诊疗，医护，公共卫生」，「质量」，「生活便利」」，「「硅谷，矽谷，佛罗伦萨，佛罗伦斯，旧金山，三藩市」，「创意，创新，创造力」」，「「转型」，「2011，一一，逐一，百分之五十，50」，「第三产业，服务业，第一产业，第二产业」，「工业，制造业，产业」，「城市化率」」，「「生育率，出生率」，「负面」，「污染，废水」，「规划，规画，建设」，「拥挤，挤迫，拥堵，交通堵塞」」」",
            "inOptimize": False,
            "lastOpDate": '2019-03-09',
            "upCount": 9,
            "downCount": 4,
        }
        ,
        {
            "questionId":
                4,
            "rawText":
                "玻璃，也就是二氧化硅，是一种非常重要的元素。硅元素在地球上的含量极其丰富，地壳里90%都是由硅元素组成的，因此玻璃的价格很便宜。玻璃的透光性很高，小到显微镜、电脑芯片，大到天文望远镜和连接全球的光纤，都离不开它。玻璃纤维的强度非常大，从制作防弹衣，到组成空客A380飞机的机身，玻璃纤维都是重要的材料。但玻璃也有弹性差、易碎的特点，破碎后容易伤人。",
            "keywords":
                "「「二氧化硅」，「玻璃」，「元素」，「重要，最主要，举足轻重，关键，不可或缺，不可忽视」」",
            "mainwords":
                "「「丰富，多样，大，多」，「透光性」，「用途，用作，用处」，「强度，硬度，坚硬」，「伤人，伤害」」",
            "detailwords":
                "「「「90，九十」，「地壳」，「含量，浓度，所含」，「便宜，低廉，廉价，廉宜」」，「「电脑芯片」，「光纤」，「显微镜，光学，透镜」，「望远镜」」，「「防弹衣，防弹背心」，「空客，空中客车，空中巴士，客机，飞机，民航机，航空器，A380」，「纤维」」，「「弹性，刚性」，「易碎，脆弱」」」",
            "inOptimize": True,
            "lastOpDate": '2019-03-09',
        }
        ,
        {
            "questionId":
                5,
            "rawText":
                "咖啡是现代生活中非常重要的饮品。喝咖啡有许多好处，首先它可以提神醒脑，是很多上班族的必备。其次，喝咖啡对身体健康有好处，比如：咖啡利尿，可以帮助排出身体毒素；咖啡对降低癌症风险、过劳死风险都有一定作用。第三，咖啡有利于情绪培养。实验表明，人一天吸收300毫克的咖啡因，约3杯现煮咖啡，对一个人的机警程度和情绪都会带来良好的影响。但需要注意的是，喝咖啡的时间应该在早晨或餐后，而不能在随餐伴饮，而很多速溶咖啡为了口味，加入了大量脂肪和糖，不能多喝。",
            "keywords":
                "「「饮品，饮料」，「咖啡」，「现代，当代」，「生活」，「重要，最主要，举足轻重，关键，不可或缺，不可忽视，不可缺少」」",
            "mainwords":
                "「「提神」，「健康」，「情绪，焦虑，情感」，「注意，留意，缺点，负面」」",
            "detailwords":
                "「「「上班，办公室，白领，公司」，「好处，益处，优点」」，「「利尿，排水」，「毒素，有毒」，「过劳死」，「癌」」，「「情绪，焦虑，情感」，「300，三，3」，「机警，机灵」，「咖啡因」」，「「早晨，早上，清晨，餐后，随餐」，「速溶」，「糖」，「脂肪，油脂」」」",
            "inOptimize": False,
            "lastOpDate": '2019-03-09',
        }
        ,
        {
            "questionId":
                6,
            "rawText":
                "旅游是很好的休闲方式，比起跟团游，现在更多人选择自由行，2016年，有57%的人选择了自由行。自由行的好处很多，首先，它可以按照个人喜好制定行程和游玩地点，不用千篇一律。其次，自由行的质量也更高，比起跟团游上车睡觉，下车拍照的方式，自由行可以深入游览，体验风土人情。自由行也更符合每个人的生活习惯，习惯晚起的人不用一大早就去赶团队行程，饮食选择、住宿选择也更多样化。但自由行对出行者的经验要求较高，要提前做功课，了解游玩地点；遇到突发状况也都要自己处理，需要很强的风险防范意识和应对能力。",
            "keywords":
                "「「自由行」，「跟团游，旅游，观光」，「方式，方法，形式，手段」，「好处，优点，益处，优势」」",
            "mainwords":
                "「「喜好，爱好，嗜好，喜欢，口味」，「质量」，「习惯，个性化，定制」，「经验，专业知识，经历」」",
            "detailwords":
                "「「「57，五十七，60，六十」，「2016，一六」，「千篇一律，类似，一样」，「行程，路线，攻略」，「地点，景点」」，「「深入，当地」，「风土人情，见闻，体验，体会」」，「「住宿，住」，「饮食，吃」，「多样化，多元化」，「时间」」，「「突发状况，突发，应对」，「风险，可能性，防范」，「提前，准备，功课，了解」」」",
            "inOptimize": False,
            "lastOpDate": '2019-03-09',
        }
    ]
}

question_db = [
    {
        "questionId": 2,
        "rawText": "\u9ad8\u94c1\u662f\u73b0\u5728\u662f\u6700\u53d7\u6b22\u8fce\u7684\u51fa\u884c\u65b9\u5f0f\u3002\u9996\u5148\uff0c\u9ad8\u94c1\u901f\u5ea6\u5feb\uff0c\u6bd4\u5982\u8bf4\uff0c\u4ee5\u524d\u4ece\u8d35\u9633\u5230\u5317\u4eac\uff0c\u8981\u752840\u4e2a\u5c0f\u65f6\u5de6\u53f3\uff0c\u4f46\u73b0\u5728\u9ad8\u94c1\u53ea\u9700\u89816\u4e2a\u5c0f\u65f6\uff0c\u5927\u5927\u51cf\u5c11\u4e86\u8def\u9014\u65f6\u95f4\u3002\u5176\u6b21\uff0c\u9ad8\u94c1\u6b63\u70b9\u7387\u9ad8\uff0c\u56e0\u4e3a\u9ad8\u94c1\u53d7\u5929\u6c14\u6761\u4ef6\u5f71\u54cd\u8f83\u5c0f\uff0c\u901a\u5e38\u90fd\u53ef\u4ee5\u51c6\u65f6\u53d1\u8f66\uff0c\u6309\u65f6\u5230\u8fbe\u3002\u6700\u540e\uff0c\u9ad8\u94c1\u73af\u5883\u8212\u9002\uff0c\u9ad8\u94c1\u5750\u5e2d\u5bbd\u655e\uff0c\u8fd0\u884c\u65f6\u901f\u5ea6\u5e73\u7a33\uff0c\u6ca1\u6709\u566a\u97f3\uff0c\u9910\u8f66\u73af\u5883\u6574\u6d01\uff0c\u914d\u6709\u7535\u6e90\u63d2\u5ea7\u548c\u65e0\u7ebf\u7f51\u7edc\uff0c\u4e58\u5750\u9ad8\u94c1\u5f88\u5c11\u4f1a\u9020\u6210\u4e0d\u9002\u611f\uff0c\u5bf9\u4e8e\u4e0d\u4e60\u60ef\u5750\u98de\u673a\u51fa\u884c\u7684\u4eba\u58eb\uff0c\u9ad8\u94c1\u662f\u66f4\u7406\u60f3\u7684\u9009\u62e9\u3002\u4f46\u9ad8\u94c1\u7684\u5efa\u8bbe\uff0c\u524d\u671f\u6295\u8d44\u975e\u5e38\u5de8\u5927\uff0c\u5bf9\u8bbe\u5907\u6280\u672f\u3001\u5236\u4f5c\u5de5\u827a\u8981\u6c42\u90fd\u5f88\u9ad8\uff0c\u540e\u671f\u7684\u7ba1\u7406\u8fd0\u8425\u4e5f\u9700\u8981\u66f4\u4e13\u4e1a\u7684\u4eba\u5458\u6765\u5b8c\u6210\u3002",
        "keywords": [["\u9ad8\u94c1", "\u9ad8\u901f\u94c1\u8def"],
                     ["\u65b9\u5f0f", "\u65b9\u6cd5", "\u5f62\u5f0f", "\u624b\u6bb5"], ["\u51fa\u884c"],
                     ["\u6027\u4ef7\u6bd4", "\u53d7\u6b22\u8fce", "\u70ed\u95e8", "\u7545\u9500", "\u51fa\u540d"]],
        "mainwords": [["\u901f\u5ea6", "\u901f\u7387"], ["\u8212\u9002", "\u4e0d\u9002\u611f"],
                      ["\u6b63\u70b9", "\u51c6\u70b9", "\u8bef\u70b9"],
                      ["\u6210\u672c", "\u6548\u7387", "\u8d39\u7528", "\u6548\u76ca", "\u4ef7\u683c"]],
        "detailwords": [[["40", "\u56db\u5341", "6", "\u516d", "\u8d35\u9633", "\u6606\u660e", "\u6842\u6797",
                          "\u6210\u90fd", "\u67f3\u5dde", "\u5357\u5b81", "\u8d35\u5dde", "\u9075\u4e49",
                          "\u8499\u81ea"],
                         ["\u5929\u6c14", "\u5929\u5019", "\u98de\u673a", "\u76f4\u5347\u673a", "\u6c11\u822a\u673a",
                          "\u8d77\u98de", "\u98de\u884c\u4e2d", "\u822a\u7a7a\u5668"],
                         ["\u7535\u6e90", "\u7535\u6c60", "\u7535\u8def", "\u5f00\u5173", "\u63a7\u5236\u5668",
                          "\u5143\u4ef6", "\u8bbe\u5907", "\u9910\u8f66", "\u65e0\u7ebf", "wifi"]],
                        [["\u8fd0\u8425", "\u8425\u8fd0", "\u8fd0\u884c"], ["\u4e13\u4e1a"],
                         ["\u7ba1\u7406", "\u76d1\u7ba1", "\u884c\u653f"]]],
        "backup": []
    },
    {
        "questionId": 3,
        "rawText": "\u57ce\u5e02\u4f1a\u8ba9\u751f\u6d3b\u66f4\u7f8e\u597d\u3002\u5728\u57ce\u5e02\u91cc\u5c45\u4f4f\uff0c\u53ef\u4ee5\u4eab\u53d7\u66f4\u591a\u3001\u66f4\u9ad8\u8d28\u91cf\u7684\u533b\u7597\u548c\u6559\u80b2\u8d44\u6e90\uff0c\u751f\u6d3b\u7684\u4fbf\u5229\u7a0b\u5ea6\u4e5f\u66f4\u9ad8\u3002\u57ce\u5e02\u4e5f\u662f\u96c6\u805a\u4eba\u624d\uff0c\u6fc0\u53d1\u521b\u610f\u7684\u5730\u65b9\uff0c\u6587\u827a\u590d\u5174\u65f6\u5019\u7684\u4f5b\u7f57\u4f26\u8428\uff0c\u7845\u8c37\u6240\u5728\u7684\u65e7\u91d1\u5c71\u90fd\u662f\u5178\u578b\u7684\u4f8b\u5b50\u3002\u53e6\u5916\uff0c\u57ce\u5e02\u5316\u4e5f\u6709\u5229\u4e8e\u56fd\u5bb6\u7ecf\u6d4e\u6a21\u5f0f\u7684\u8f6c\u578b\uff0c\u4ece\u519c\u4e1a\u4e3a\u4e3b\uff0c\u5f80\u5de5\u4e1a\u548c\u7b2c\u4e09\u4ea7\u4e1a\u7684\u8f6c\u578b\uff0c2011\u5e74\uff0c\u4e2d\u56fd\u7684\u57ce\u5e02\u5316\u7387\u5df2\u7ecf\u8d85\u8fc7\u4e8650%\u3002\u4f46\u57ce\u5e02\u4e5f\u4f1a\u5e26\u6765\u62e5\u6324\u3001\u6c61\u67d3\u4ee5\u53ca\u751f\u80b2\u7387\u4e0b\u964d\u7b49\u8d1f\u9762\u95ee\u9898\uff0c\u9700\u8981\u66f4\u597d\u7684\u89c4\u5212\u53d1\u5c55\u6765\u89e3\u51b3\u3002",
        "keywords": [["\u7f8e\u597d", "\u5e78\u798f", "\u5feb\u4e50"],
                     ["\u57ce\u5e02", "\u90ca\u533a", "\u5927\u90fd\u5e02"], ["\u751f\u6d3b"]],
        "mainwords": [["\u8d44\u6e90"], ["\u4eba\u624d", "\u4eba\u6750"],
                      ["\u7ecf\u6d4e\u6a21\u5f0f", "\u5e02\u573a\u7ecf\u6d4e"], ["\u95ee\u9898", "\u96be\u9898"]],
        "detailwords": [[["\u6559\u80b2", "\u6559\u5b66"],
                         ["\u533b\u7597", "\u7167\u62a4", "\u536b\u751f\u4fdd\u5065", "\u8bca\u7597", "\u533b\u62a4",
                          "\u516c\u5171\u536b\u751f"], ["\u8d28\u91cf"], ["\u751f\u6d3b\u4fbf\u5229"]], [
                            ["\u7845\u8c37", "\u77fd\u8c37", "\u4f5b\u7f57\u4f26\u8428", "\u4f5b\u7f57\u4f26\u65af",
                             "\u65e7\u91d1\u5c71", "\u4e09\u85e9\u5e02"],
                            ["\u521b\u610f", "\u521b\u65b0", "\u521b\u9020\u529b"]], [["\u8f6c\u578b"],
                                                                                      ["2011", "\u4e00\u4e00",
                                                                                       "\u9010\u4e00",
                                                                                       "\u767e\u5206\u4e4b\u4e94\u5341",
                                                                                       "50"],
                                                                                      ["\u7b2c\u4e09\u4ea7\u4e1a",
                                                                                       "\u670d\u52a1\u4e1a",
                                                                                       "\u7b2c\u4e00\u4ea7\u4e1a",
                                                                                       "\u7b2c\u4e8c\u4ea7\u4e1a"],
                                                                                      ["\u5de5\u4e1a",
                                                                                       "\u5236\u9020\u4e1a",
                                                                                       "\u4ea7\u4e1a"],
                                                                                      ["\u57ce\u5e02\u5316\u7387"]],
                        [["\u751f\u80b2\u7387", "\u51fa\u751f\u7387"], ["\u8d1f\u9762"],
                         ["\u6c61\u67d3", "\u5e9f\u6c34"], ["\u89c4\u5212", "\u89c4\u753b", "\u5efa\u8bbe"],
                         ["\u62e5\u6324", "\u6324\u8feb", "\u62e5\u5835", "\u4ea4\u901a\u5835\u585e"]]],
        "backup": [{"label": "2018-12-28 08:13:21.184000", "backupId": "5c25db21dd626226addee466"}]
    },
    {
        "questionId": 4,
        "rawText": "\u73bb\u7483\uff0c\u4e5f\u5c31\u662f\u4e8c\u6c27\u5316\u7845\uff0c\u662f\u4e00\u79cd\u975e\u5e38\u91cd\u8981\u7684\u5143\u7d20\u3002\u7845\u5143\u7d20\u5728\u5730\u7403\u4e0a\u7684\u542b\u91cf\u6781\u5176\u4e30\u5bcc\uff0c\u5730\u58f3\u91cc90%\u90fd\u662f\u7531\u7845\u5143\u7d20\u7ec4\u6210\u7684\uff0c\u56e0\u6b64\u73bb\u7483\u7684\u4ef7\u683c\u5f88\u4fbf\u5b9c\u3002\u73bb\u7483\u7684\u900f\u5149\u6027\u5f88\u9ad8\uff0c\u5c0f\u5230\u663e\u5fae\u955c\u3001\u7535\u8111\u82af\u7247\uff0c\u5927\u5230\u5929\u6587\u671b\u8fdc\u955c\u548c\u8fde\u63a5\u5168\u7403\u7684\u5149\u7ea4\uff0c\u90fd\u79bb\u4e0d\u5f00\u5b83\u3002\u73bb\u7483\u7ea4\u7ef4\u7684\u5f3a\u5ea6\u975e\u5e38\u5927\uff0c\u4ece\u5236\u4f5c\u9632\u5f39\u8863\uff0c\u5230\u7ec4\u6210\u7a7a\u5ba2A380\u98de\u673a\u7684\u673a\u8eab\uff0c\u73bb\u7483\u7ea4\u7ef4\u90fd\u662f\u91cd\u8981\u7684\u6750\u6599\u3002\u4f46\u73bb\u7483\u4e5f\u6709\u5f39\u6027\u5dee\u3001\u6613\u788e\u7684\u7279\u70b9\uff0c\u7834\u788e\u540e\u5bb9\u6613\u4f24\u4eba\u3002",
        "keywords": [["\u4e8c\u6c27\u5316\u7845"], ["\u73bb\u7483"], ["\u5143\u7d20"],
                     ["\u91cd\u8981", "\u6700\u4e3b\u8981", "\u4e3e\u8db3\u8f7b\u91cd", "\u5173\u952e",
                      "\u4e0d\u53ef\u6216\u7f3a", "\u4e0d\u53ef\u5ffd\u89c6"]],
        "mainwords": [["\u4e30\u5bcc", "\u591a\u6837", "\u5927", "\u591a"], ["\u900f\u5149\u6027"],
                      ["\u7528\u9014", "\u7528\u4f5c", "\u7528\u5904"],
                      ["\u5f3a\u5ea6", "\u786c\u5ea6", "\u575a\u786c"], ["\u4f24\u4eba", "\u4f24\u5bb3"]],
        "detailwords": [[["90", "\u4e5d\u5341"], ["\u5730\u58f3"], ["\u542b\u91cf", "\u6d53\u5ea6", "\u6240\u542b"],
                         ["\u4fbf\u5b9c", "\u4f4e\u5ec9", "\u5ec9\u4ef7", "\u5ec9\u5b9c"]],
                        [["\u7535\u8111\u82af\u7247"], ["\u5149\u7ea4"],
                         ["\u663e\u5fae\u955c", "\u5149\u5b66", "\u900f\u955c"], ["\u671b\u8fdc\u955c"]],
                        [["\u9632\u5f39\u8863", "\u9632\u5f39\u80cc\u5fc3"],
                         ["\u7a7a\u5ba2", "\u7a7a\u4e2d\u5ba2\u8f66", "\u7a7a\u4e2d\u5df4\u58eb", "\u5ba2\u673a",
                          "\u98de\u673a", "\u6c11\u822a\u673a", "\u822a\u7a7a\u5668", "A380"], ["\u7ea4\u7ef4"]],
                        [["\u5f39\u6027", "\u521a\u6027"], ["\u6613\u788e", "\u8106\u5f31"]]],
        "backup": [{"label": "2018-12-28 08:26:04.095000", "backupId": "5c25de1cdd626226addee467"}]
    },
    {
        "questionId": 5,
        "rawText": "\u5496\u5561\u662f\u73b0\u4ee3\u751f\u6d3b\u4e2d\u975e\u5e38\u91cd\u8981\u7684\u996e\u54c1\u3002\u559d\u5496\u5561\u6709\u8bb8\u591a\u597d\u5904\uff0c\u9996\u5148\u5b83\u53ef\u4ee5\u63d0\u795e\u9192\u8111\uff0c\u662f\u5f88\u591a\u4e0a\u73ed\u65cf\u7684\u5fc5\u5907\u3002\u5176\u6b21\uff0c\u559d\u5496\u5561\u5bf9\u8eab\u4f53\u5065\u5eb7\u6709\u597d\u5904\uff0c\u6bd4\u5982\uff1a\u5496\u5561\u5229\u5c3f\uff0c\u53ef\u4ee5\u5e2e\u52a9\u6392\u51fa\u8eab\u4f53\u6bd2\u7d20\uff1b\u5496\u5561\u5bf9\u964d\u4f4e\u764c\u75c7\u98ce\u9669\u3001\u8fc7\u52b3\u6b7b\u98ce\u9669\u90fd\u6709\u4e00\u5b9a\u4f5c\u7528\u3002\u7b2c\u4e09\uff0c\u5496\u5561\u6709\u5229\u4e8e\u60c5\u7eea\u57f9\u517b\u3002\u5b9e\u9a8c\u8868\u660e\uff0c\u4eba\u4e00\u5929\u5438\u6536300\u6beb\u514b\u7684\u5496\u5561\u56e0\uff0c\u7ea63\u676f\u73b0\u716e\u5496\u5561\uff0c\u5bf9\u4e00\u4e2a\u4eba\u7684\u673a\u8b66\u7a0b\u5ea6\u548c\u60c5\u7eea\u90fd\u4f1a\u5e26\u6765\u826f\u597d\u7684\u5f71\u54cd\u3002\u4f46\u9700\u8981\u6ce8\u610f\u7684\u662f\uff0c\u559d\u5496\u5561\u7684\u65f6\u95f4\u5e94\u8be5\u5728\u65e9\u6668\u6216\u9910\u540e\uff0c\u800c\u4e0d\u80fd\u5728\u968f\u9910\u4f34\u996e\uff0c\u800c\u5f88\u591a\u901f\u6eb6\u5496\u5561\u4e3a\u4e86\u53e3\u5473\uff0c\u52a0\u5165\u4e86\u5927\u91cf\u8102\u80aa\u548c\u7cd6\uff0c\u4e0d\u80fd\u591a\u559d\u3002",
        "keywords": [["\u996e\u54c1", "\u996e\u6599"], ["\u5496\u5561"], ["\u73b0\u4ee3", "\u5f53\u4ee3"],
                     ["\u751f\u6d3b"],
                     ["\u91cd\u8981", "\u6700\u4e3b\u8981", "\u4e3e\u8db3\u8f7b\u91cd", "\u5173\u952e",
                      "\u4e0d\u53ef\u6216\u7f3a", "\u4e0d\u53ef\u5ffd\u89c6", "\u4e0d\u53ef\u7f3a\u5c11"]],
        "mainwords": [["\u63d0\u795e"], ["\u5065\u5eb7"], ["\u60c5\u7eea", "\u7126\u8651", "\u60c5\u611f"],
                      ["\u6ce8\u610f", "\u7559\u610f", "\u7f3a\u70b9", "\u8d1f\u9762"]],
        "detailwords": [[["\u4e0a\u73ed", "\u529e\u516c\u5ba4", "\u767d\u9886", "\u516c\u53f8"],
                         ["\u597d\u5904", "\u76ca\u5904", "\u4f18\u70b9"]],
                        [["\u5229\u5c3f", "\u6392\u6c34"], ["\u6bd2\u7d20", "\u6709\u6bd2"], ["\u8fc7\u52b3\u6b7b"],
                         ["\u764c"]], [["\u60c5\u7eea", "\u7126\u8651", "\u60c5\u611f"], ["300", "\u4e09", "3"],
                                       ["\u673a\u8b66", "\u673a\u7075"], ["\u5496\u5561\u56e0"]],
                        [["\u65e9\u6668", "\u65e9\u4e0a", "\u6e05\u6668", "\u9910\u540e", "\u968f\u9910"],
                         ["\u901f\u6eb6"], ["\u7cd6"], ["\u8102\u80aa", "\u6cb9\u8102"]]],
        "backup": [{"label": "2018-12-28 08:34:52.800000", "backupId": "5c25e02cdd626226addee468"}]
    }
]

question_from_pool = {
    "rawText": "\u73bb\u7483\uff0c\u4e5f\u5c31\u662f\u4e8c\u6c27\u5316\u7845\uff0c\u662f\u4e00\u79cd\u975e\u5e38\u91cd\u8981\u7684\u5143\u7d20\u3002\u7845\u5143\u7d20\u5728\u5730\u7403\u4e0a\u7684\u542b\u91cf\u6781\u5176\u4e30\u5bcc\uff0c\u5730\u58f3\u91cc90%\u90fd\u662f\u7531\u7845\u5143\u7d20\u7ec4\u6210\u7684\uff0c\u56e0\u6b64\u73bb\u7483\u7684\u4ef7\u683c\u5f88\u4fbf\u5b9c\u3002\u73bb\u7483\u7684\u900f\u5149\u6027\u5f88\u9ad8\uff0c\u5c0f\u5230\u663e\u5fae\u955c\u3001\u7535\u8111\u82af\u7247\uff0c\u5927\u5230\u5929\u6587\u671b\u8fdc\u955c\u548c\u8fde\u63a5\u5168\u7403\u7684\u5149\u7ea4\uff0c\u90fd\u79bb\u4e0d\u5f00\u5b83\u3002\u73bb\u7483\u7ea4\u7ef4\u7684\u5f3a\u5ea6\u975e\u5e38\u5927\uff0c\u4ece\u5236\u4f5c\u9632\u5f39\u8863\uff0c\u5230\u7ec4\u6210\u7a7a\u5ba2A380\u98de\u673a\u7684\u673a\u8eab\uff0c\u73bb\u7483\u7ea4\u7ef4\u90fd\u662f\u91cd\u8981\u7684\u6750\u6599\u3002\u4f46\u73bb\u7483\u4e5f\u6709\u5f39\u6027\u5dee\u3001\u6613\u788e\u7684\u7279\u70b9\uff0c\u7834\u788e\u540e\u5bb9\u6613\u4f24\u4eba\u3002",
    "keywords": [["\u4e8c\u6c27\u5316\u7845"], ["\u73bb\u7483"], ["\u5143\u7d20"],
                 ["\u91cd\u8981", "\u6700\u4e3b\u8981", "\u4e3e\u8db3\u8f7b\u91cd", "\u5173\u952e",
                  "\u4e0d\u53ef\u6216\u7f3a", "\u4e0d\u53ef\u5ffd\u89c6"]],
    "mainwords": [["\u4e30\u5bcc", "\u591a\u6837", "\u5927", "\u591a"], ["\u900f\u5149\u6027"],
                  ["\u7528\u9014", "\u7528\u4f5c", "\u7528\u5904"], ["\u5f3a\u5ea6", "\u786c\u5ea6", "\u575a\u786c"],
                  ["\u4f24\u4eba", "\u4f24\u5bb3"]],
    "detailwords": [[["90", "\u4e5d\u5341"], ["\u5730\u58f3"], ["\u542b\u91cf", "\u6d53\u5ea6", "\u6240\u542b"],
                     ["\u4fbf\u5b9c", "\u4f4e\u5ec9", "\u5ec9\u4ef7", "\u5ec9\u5b9c"]],
                    [["\u7535\u8111\u82af\u7247"], ["\u5149\u7ea4"],
                     ["\u663e\u5fae\u955c", "\u5149\u5b66", "\u900f\u955c"], ["\u671b\u8fdc\u955c"]],
                    [["\u9632\u5f39\u8863", "\u9632\u5f39\u80cc\u5fc3"],
                     ["\u7a7a\u5ba2", "\u7a7a\u4e2d\u5ba2\u8f66", "\u7a7a\u4e2d\u5df4\u58eb", "\u5ba2\u673a",
                      "\u98de\u673a", "\u6c11\u822a\u673a", "\u822a\u7a7a\u5668", "A380"], ["\u7ea4\u7ef4"]],
                    [["\u5f39\u6027", "\u521a\u6027"], ["\u6613\u788e", "\u8106\u5f31"]]]
}
